check.txt


			<soapenv:Envelope
			xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
			xmlns:util="http://www.travelport.com/schema/util_v37_0"
			xmlns:com="http://www.travelport.com/schema/common_v37_0">
			<soapenv:Header/>
			<soapenv:Body>
			<shar:BookingStartReq TraceId="trace_89789" AuthorizedBy="user"
			TargetBranch="P7090934" ProviderCode="1G">
				<com:BillingPointOfSaleInfo OriginApplication="UAPI"/>
			</shar:BookingStartReq>
			</soapenv:Body>
			</soapenv:Envelope>

			<soapenv:Envelope
			xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
			xmlns:util="http://www.travelport.com/schema/util_v34_0"
			xmlns:com="http://www.travelport.com/schema/common_v34_0">
			<soapenv:Header/>
			<soapenv:Body>
			<shar:BookingStartReq TraceId="trace_89789" AuthorizedBy="user"
			TargetBranch="P7090934" ProviderCode="1G">
				<com:BillingPointOfSaleInfo OriginApplication="UAPI"/>
			</shar:BookingStartReq>
			</soapenv:Body>
			</soapenv:Envelope>

			<soapenv:Envelope
			xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
			xmlns:util="http://www.travelport.com/schema/util_v34_0"
			xmlns:com="http://www.travelport.com/schema/common_v34_0">
			<soapenv:Header/>
			<soapenv:Body>
			<shar:BookingStartReq TraceId="trace_89789" AuthorizedBy="TVPT"
			TargetBranch="P7090934" ProviderCode="1G">
				<com:BillingPointOfSaleInfo OriginApplication="UAPI"/>
			</shar:BookingStartReq>
			</soapenv:Body>
			</soapenv:Envelope>
				<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:shar="http://www.travelport.com/schema/sharedBooking_v34_0" xmlns:com="http://www.travelport.com/schema/common_v34_0">
<soapenv:Header/>
<soapenv:Body>
<shar:BookingStartReq TraceId="trace" AuthorizedBy="TVPT" TargetBranch="P7090934" ProviderCode="1G">
<com:BillingPointOfSaleInfo OriginApplication="UAPI"/>
</shar:BookingStartReq>
</soapenv:Body>
</soapenv:Envelope>
				<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:shar="http://www.travelport.com/schema/sharedBooking_v34_0" xmlns:com="http://www.travelport.com/schema/common_v34_0">
<soapenv:Header/>
<soapenv:Body>
<shar:BookingStartReq TraceId="c7e2d212-0e77-458e-87e9-e4b361ffdd3" AuthorizedBy="TVPT" TargetBranch="P7090934" ProviderCode="1G">
<com:BillingPointOfSaleInfo OriginApplication="UAPI"/>
</shar:BookingStartReq>
</soapenv:Body>
</soapenv:Envelope>
				<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
			xmlns:shar="http://www.travelport.com/schema/sharedBooking_v34_0"
			xmlns:com="http://www.travelport.com/schema/common_v34_0">
<soapenv:Header/>
<soapenv:Body>
<shar:BookingStartReq TraceId="c7e2d212-0e77-458e-87e9-e4b361ffdd3"
 TargetBranch="P7090934" ProviderCode="1G">
<com:BillingPointOfSaleInfo OriginApplication="UAPI"/>
</shar:BookingStartReq>
</soapenv:Body>
</soapenv:Envelope>
				<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
			xmlns:shar="http://www.travelport.com/schema/sharedBooking_v34_0"
			xmlns:com="http://www.travelport.com/schema/common_v34_0">
<soapenv:Header/>
<soapenv:Body>
<shar:BookingStartReq TraceId="c7e2d212-0e77-458e-87e9-e4b361ffdd8"
 TargetBranch="P7090934" ProviderCode="1G">
<com:BillingPointOfSaleInfo OriginApplication="UAPI"/>
</shar:BookingStartReq>
</soapenv:Body>
</soapenv:Envelope>
				<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
			xmlns:shar="http://www.travelport.com/schema/sharedBooking_v34_0"
			xmlns:com="http://www.travelport.com/schema/common_v34_0">
<soapenv:Header/>
<soapenv:Body>
<shar:BookingStartReq TraceId="c7e2d212-0e77-458e-87e9-e4b361ffdd8"
 TargetBranch="P7090934" ProviderCode="1G">
<com:BillingPointOfSaleInfo OriginApplication="UAPI"/>
</shar:BookingStartReq>
</soapenv:Body>
</soapenv:Envelope>

			<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
			xmlns:shar="http://www.travelport.com/schema/sharedBooking_v34_0"
			xmlns:com="http://www.travelport.com/schema/common_v34_0">
			<soapenv:Header/>
			<soapenv:Body>
				<shar:BookingStartReq TraceId="c7e2d212-0e77-458e-87e9-e4b361ffdd8"
				 TargetBranch="P7090934" ProviderCode="1G">
				<com:BillingPointOfSaleInfo OriginApplication="UAPI"/>
				</shar:BookingStartReq>
			</soapenv:Body>
			</soapenv:Envelope>
			<?xml version="1.0"?>
<air:AirAvailInfo ProviderCode="1G"/>
<?xml version="1.0"?>
<air:AirAvailInfo ProviderCode="1G"/>
<?xml version="1.0"?>
<xmlns:air:AirAvailInfo ProviderCode="1G"/>
<?xml version="1.0"?>
<air:AirAvailInfo ProviderCode="1G"/>
<?xml version="1.0"?>
<air:AirAvailInfo ProviderCode="1G"/>
<?xml version="1.0"?>
<air:AirAvailInfo ProviderCode="1G"/>

<?xml version="1.0"?>
<xmlns:air:AirAvailInfo ProviderCode="1G"/>
<shar:AddAirSegment><air:AirSegment Key="BmuGAC8Q2BKA7HAHAAAAAA==" Group="0" Carrier="PK" FlightNumber="302" Origin="KHI" Destination="LHE" DepartureTime="2020-03-03T08:00:00.000+05:00" ArrivalTime="2020-03-03T09:45:00.000+05:00" FlightTime="105" Distance="636" ETicketability="Yes" Equipment="772" ChangeOfPlane="false" ParticipantLevel="Secure Sell" LinkAvailability="true" PolledAvailabilityOption="No polled avail exists" OptionalServicesIndicator="false" AvailabilitySource="A" AvailabilityDisplayType="Fare Shop/Optimal Shop" ProviderCode="1G"/><air:AirSegment Key="BmuGAC8Q2BKA+IAHAAAAAA==" Group="1" Carrier="PK" FlightNumber="305" Origin="LHE" Destination="KHI" DepartureTime="2020-03-27T18:00:00.000+05:00" ArrivalTime="2020-03-27T19:45:00.000+05:00" FlightTime="105" Distance="636" ETicketability="Yes" Equipment="320" ChangeOfPlane="false" ParticipantLevel="Secure Sell" LinkAvailability="true" PolledAvailabilityOption="No polled avail exists" OptionalServicesIndicator="false" AvailabilitySource="A" AvailabilityDisplayType="Fare Shop/Optimal Shop" ProviderCode="1G"/></shar:AddAirSegment>
